hh.org
#+HTML_HEAD: -*- fill-column: 92 -*-

#+TITLE: Модуль HeadHunter

#+NAME:css
#+BEGIN_HTML
<link rel="stylesheet" type="text/css" href="css/css.css" />
#+END_HTML

TODO: Обсудить все нижеследующее с hr-специалистами

* Введение

  Мы все ищем работу на профильных сайтах, но, к сожалению, не всегда на них хватает
  функционала, особенно нестандартного. Работая с сайтом в автоматическом режиме мы можем
  восполнить этот пробел.

  Кроме того есть множество конкурирующих сайтов для поиска работы, информацию с которых
  можно аггрегировать.

  При поиске работы основной сценарий использования - поиск вакансий, и практически все
  сайты его предоставляют. Однако мне бы хотелось дополнительно иметь:
  - функционал заметок по каждой вакансии
  - статусы, такие как: =просмотрено= (с датой), =отобрано=, =не-берут-трубку=,
    =не-актуально=, =приглашен-на-интервью=, =тестовое-задание=, =получен-оффер=,
    =отказано-работодателем=, =отказ-соискателя=, =вакансия-снята= итп. Более подробно это
    уточняется в секции [[Вакансии]]

  Я бы хотел ранжировать вакансии вручную (по выставленным приоритетам) и автоматически,
  например в зависимости от зарплаты или удаленности от дома.

  В идеале я бы хотел иметь возможность планировать маршрут, когда еду на собеседование и
  иметь календарь, чтобы не пропустить встречу.

  Я бы хотел иметь версии вакансий, чтобы отслеживать их изменения, например изменения
  зарплаты до и после моего интервью - это позволит анализировать рынок и получать больше
  информации.

  Мне также интересно составлять профили компаний и отслеживать как меняется набор
  сотрудников которых они ищут - это поможет планировать долгосрочную стратегию. Особенно в
  этом плане интересны лидеры рынка - Яндекс, Гугл и.т.п.

  Почему сайты поиска работы не предоставляют подобный сервис для соискателей - для меня
  загадка и повод подумать над стартапом :) Кстати похожие кейсы наверное есть и в
  покупке/продаже автотранспорта или барахолках типа авито.

  Позже можно добавить социальный шаринг всего этого дела, чтобы любой соискатель мог
  рассказать о своем опыте взаимодействия с потенциальным работодателем.

  Иногда мне приятно работать с уже знакомыми людьми, так что в целом я бы не отказался
  создавать на таком сайте что-то типа т.н. =рабочих коллективов=, чтобы наниматься сразу
  командой. Возможно работодателям такой вариант найма тоже будет интересен.

* Сценарии использования

  Зарегистрированный пользователь создает "поисковый профиль", в который заносит поисковый
  запрос и (в будущем) источники данных.

  Потом он планирует сбор данных. Пока сбор будет осуществляеться по запросу, позже можно
  будет запланировать, к примеру "еженедельный сбор"

  Система осуществляет сбор данных и предоставляет пользователю интерфейс доступа к ним

  Пользователь просматривает, дополняет изменяет данные, вносит заметки, звонит по вакансиям
  и отражает это в данных.

** Поисковые профили и сбор данных

   Чтобы у нас были данные, с которыми мы собираемся работать - их надо откуда-то
   собрать, например, с профильных сайтов, таких как http://hh.ru

   Разумеется, лучше собирать не все подряд, а только то что необходимо соискателю. Когда
   соискатель пользуется профильным сайтом он использует поисковые запросы, на основании
   которых мы можем формировать, гм... назовем это =поисковыми профилями=. Поисковый
   профиль - это запрос пользователя, плюс связанные с ним данные - назовем их =сборками=.

   Сборки по одному поисковому профилю могут осуществляться в разное время. Они часто
   интересны тем, что можно посмотреть как появляются и исчезают вакансии. В каждой сборке
   содержится набор =вакансий=, при этом одни и те же по сути вакансии в разных сборках
   связываются между собой, чтобы можно было отслеживать изменения вакансии с течением
   времени.

   Вакансии на сайтах размещаются =компаниями= и привязываются к ним. Мне, как соискателю,
   интересно посмотреть какие вакансии размещала ранее конкретная компания, какие она
   размещает теперь, как изменялись зарплаты - и тому подобная аналитическая информация.

   Загрузка данных начинается с автоматического использования поиска. Мне интересны разные
   поисковые запросы - например, "веб-программист", "менеджер проекта", "руководитель
   отдела" и.т.п. По каждому из них можно составить поисковый профиль, который кроме текущих
   актуальных вакансий в нем содержит еще и "сборки" - с датой и временем получения данных и
   "изменения", т.е диффы между предыдущей сборкой и этой. Таким образом, например, можно
   отслеживать только что появляющиеся вакансии, которые часто представляют наибольший
   интерес.

   Мне бы хотелось осуществлять =сбор данных в многопоточном режиме=.

** Поиск вакансий

   Внутри вакансий необходимо искать по критериям, которые я уточню позже

   Мне хотелось бы чтобы вакансии были упорядочены по зарплате

   Мне бы хотелось сразу получать представление, насколько свежая вакансия

   Мне было бы интересно, сколько интервью было проведено и запланировано по вакансии - эту
   информацию можно узнать из анализа активности по ней других пользователей

   Мне было бы интересно, как менялась вакансия с момента ее размещения компанией - можно
   находить и отслеживать похожие вакансии по расстоянию Левенштейна в описании, к
   примеру. Динамика изменения зарплатного предложения может многое сказать об отношении к
   вакансии.

** Просмотр и отбор вакансий, заметки и выставление статусов

   Когда я читаю вакансию, я бы хотел, чтобы она переходила в статус "просмотрено" (и к ней
   добавлялась дата просмотра)

   Читая вакансию, мне бы хотелось устанавливать ей приоритет и вносить заметки, чтобы
   отслеживать такие моменты, как например: необходимость позвонить позже, или все, что мне
   сказал hr по телефону. Есть типовые вещи, которые можно просто сделать кнопками.

   Если я отправляю отзыв на вакансию или звоню по телефону - я бы хотел, чтобы эти действия
   сопровождались временем и изменением статуса, чтобы потом можно было отследить историю
   взаимодействия с фирмой.

   При этом, мне хотелось бы видеть на дашборде те вакансии, с которыми я договорился о
   встрече и те, по которым нет движения долгое время, чтобы ничего не забывалось.

