hh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Модуль HeadHunter</title>
<!-- 2014-11-30 Вс. 05:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rigidus" />
-*- fill-column: 92 -*-
</head>
<body>
<div id="content">
<h1 class="title">Модуль HeadHunter</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Введение</a></li>
<li><a href="#sec-2">2. Сценарии использования</a>
<ul>
<li><a href="#sec-2-1">2.1. Поисковые профили и сбор данных</a></li>
<li><a href="#sec-2-2">2.2. Поиск вакансий</a></li>
<li><a href="#sec-2-3">2.3. Просмотр и отбор вакансий, заметки и выставление статусов</a></li>
<li><a href="#sec-2-4">2.4. Дашборд</a></li>
<li><a href="#sec-2-5">2.5. Отзывы соискателей о компаниях и вакансиях</a></li>
<li><a href="#sec-2-6">2.6. Маршрут</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Сущности</a>
<ul>
<li><a href="#sec-3-1">3.1. Поисковые профили</a></li>
<li><a href="#sec-3-2">3.2. Сборки</a></li>
<li><a href="#sec-3-3">3.3. Вакансии</a></li>
<li><a href="#sec-3-4">3.4. <span class="todo nilTODO">TODO</span> Перекрестные связи с другими вакансиями</a></li>
<li><a href="#sec-3-5">3.5. Компании</a></li>
<li><a href="#sec-3-6">3.6. Действия по вакансии: звонки, скайп-интервью, собеседования</a></li>
<li><a href="#sec-3-7">3.7. Теги вакансий</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Interface</a>
<ul>
<li><a href="#sec-4-1">4.1. Дашборд</a></li>
<li><a href="#sec-4-2">4.2. <span class="todo nilTODO">TODO</span> Интерфейс планирования сбора данных</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Тесты</a></li>
<li><a href="#sec-6">6. Точки входа</a></li>
<li><a href="#sec-7">7. Сборка</a>
<ul>
<li><a href="#sec-7-1">7.1. Сущности и автоматы</a></li>
<li><a href="#sec-7-2">7.2. Поисковые профили</a></li>
</ul>
</li>
</ul>
</div>
</div>
<link rel="stylesheet" type="text/css" href="css/css.css" />

<p>
TODO: Обсудить все нижеследующее с hr-специалистами
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Введение</h2>
<div class="outline-text-2" id="text-1">
<p>
Мы все ищем работу на профильных сайтах, но, к сожалению, не всегда на них хватает
функционала, особенно нестандартного. Работая с сайтом в автоматическом режиме мы можем
восполнить этот пробел.
</p>

<p>
Кроме того есть множество конкурирующих сайтов для поиска работы, информацию с которых
можно аггрегировать.
</p>

<p>
При поиске работы основной сценарий использования - поиск вакансий, и практически все
сайты его предоставляют. Однако мне бы хотелось дополнительно иметь:
</p>
<ul class="org-ul">
<li>функционал заметок по каждой вакансии
</li>
<li>статусы, такие как: <code>просмотрено</code> (с датой), <code>отобрано</code>, <code>не-берут-трубку</code>,
<code>не-актуально</code>, <code>приглашен-на-интервью</code>, <code>тестовое-задание</code>, <code>получен-оффер</code>,
<code>отказано-работодателем</code>, <code>отказ-соискателя</code>, <code>вакансия-снята</code> итп. Более подробно это
уточняется в секции <a href="#sec-3-3">3.3</a>
</li>
</ul>

<p>
Я бы хотел ранжировать вакансии вручную (по выставленным приоритетам) и автоматически,
например в зависимости от зарплаты или удаленности от дома.
</p>

<p>
В идеале я бы хотел иметь возможность планировать маршрут, когда еду на собеседование и
иметь календарь, чтобы не пропустить встречу.
</p>

<p>
Я бы хотел иметь версии вакансий, чтобы отслеживать их изменения, например изменения
зарплаты до и после моего интервью - это позволит анализировать рынок и получать больше
информации.
</p>

<p>
Мне также интересно составлять профили компаний и отслеживать как меняется набор
сотрудников которых они ищут - это поможет планировать долгосрочную стратегию. Особенно в
этом плане интересны лидеры рынка - Яндекс, Гугл и.т.п.
</p>

<p>
Почему сайты поиска работы не предоставляют подобный сервис для соискателей - для меня
загадка и повод подумать над стартапом :) Кстати похожие кейсы наверное есть и в
покупке/продаже автотранспорта или барахолках типа авито.
</p>

<p>
Позже можно добавить социальный шаринг всего этого дела, чтобы любой соискатель мог
рассказать о своем опыте взаимодействия с потенциальным работодателем.
</p>

<p>
Иногда мне приятно работать с уже знакомыми людьми, так что в целом я бы не отказался
создавать на таком сайте что-то типа т.н. <code>рабочих коллективов</code>, чтобы наниматься сразу
командой. Возможно работодателям такой вариант найма тоже будет интересен.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Сценарии использования</h2>
<div class="outline-text-2" id="text-2">
<p>
Зарегистрированный пользователь создает "поисковый профиль", в который заносит поисковый
запрос и (в будущем) источники данных.
</p>

<p>
Потом он планирует сбор данных. Пока сбор будет осуществляеться по запросу, позже можно
будет запланировать, к примеру "еженедельный сбор"
</p>

<p>
Система осуществляет сбор данных и предоставляет пользователю интерфейс доступа к ним
</p>

<p>
Пользователь просматривает, дополняет изменяет данные, вносит заметки, звонит по вакансиям
и отражает это в данных.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Поисковые профили и сбор данных</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Чтобы у нас были данные, с которыми мы собираемся работать - их надо откуда-то
собрать, например, с профильных сайтов, таких как <a href="http://hh.ru/">http://hh.ru/</a>
</p>

<p>
Разумеется, лучше собирать не все подряд, а только то что необходимо соискателю. Когда
соискатель пользуется профильным сайтом он использует поисковые запросы, на основании
которых мы можем формировать, гм&#x2026; назовем это <code>поисковыми профилями</code>. Поисковый
профиль - это запрос пользователя, плюс связанные с ним данные - назовем их <code>сборками</code>.
</p>

<p>
Сборки по одному поисковому профилю могут осуществляться в разное время. Они часто
интересны тем, что можно посмотреть как появляются и исчезают вакансии. В каждой сборке
содержится набор <code>вакансий</code>, при этом одни и те же по сути вакансии в разных сборках
связываются между собой, чтобы можно было отслеживать изменения вакансии с течением
времени.
</p>

<p>
Вакансии на сайтах размещаются <code>компаниями</code> и привязываются к ним. Мне, как соискателю,
интересно посмотреть какие вакансии размещала ранее конкретная компания, какие она
размещает теперь, как изменялись зарплаты - и тому подобная аналитическая информация.
</p>

<p>
Загрузка данных начинается с автоматического использования поиска. Мне интересны разные
поисковые запросы - например, "веб-программист", "менеджер проекта", "руководитель
отдела" и.т.п. По каждому из них можно составить поисковый профиль, который кроме текущих
актуальных вакансий в нем содержит еще и "сборки" - с датой и временем получения данных и
"изменения", т.е диффы между предыдущей сборкой и этой. Таким образом, например, можно
отслеживать только что появляющиеся вакансии, которые часто представляют наибольший
интерес.
</p>

<p>
Мне бы хотелось осуществлять <code>сбор данных в многопоточном режиме</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Поиск вакансий</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Внутри вакансий необходимо искать по критериям, которые я уточню позже
</p>

<p>
Мне хотелось бы чтобы вакансии были упорядочены по зарплате
</p>

<p>
Мне бы хотелось сразу получать представление, насколько свежая вакансия
</p>

<p>
Мне было бы интересно, сколько интервью было проведено и запланировано по вакансии - эту
информацию можно узнать из анализа активности по ней других пользователей
</p>

<p>
Мне было бы интересно, как менялась вакансия с момента ее размещения компанией - можно
находить и отслеживать похожие вакансии по расстоянию Левенштейна в описании, к
примеру. Динамика изменения зарплатного предложения может многое сказать об отношении к
вакансии.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Просмотр и отбор вакансий, заметки и выставление статусов</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Когда я читаю вакансию, я бы хотел, чтобы она переходила в статус "просмотрено" (и к ней
добавлялась дата просмотра)
</p>

<p>
Читая вакансию, мне бы хотелось устанавливать ей приоритет и вносить заметки, чтобы
отслеживать такие моменты, как например: необходимость позвонить позже, или все, что мне
сказал hr по телефону. Есть типовые вещи, которые можно просто сделать кнопками.
</p>

<p>
Если я отправляю отзыв на вакансию или звоню по телефону - я бы хотел, чтобы эти действия
сопровождались временем и изменением статуса, чтобы потом можно было отследить историю
взаимодействия с фирмой.
</p>

<p>
При этом, мне хотелось бы видеть на дашборде те вакансии, с которыми я договорился о
встрече и те, по которым нет движения долгое время, чтобы ничего не забывалось.
</p>
</div>
</div>
