hh.org
** Дашборд

   Если у нас есть формализованный алгоритм (а он есть, так как найм - это линейный
   процесс), то я хочу получать напоминания о моем следующем шаге в отношении тех вакансий,
   которые мне интересны.

   Мне бы хотелось видеть на каком я этапе в тех вакансиях, которые меня интересуют.

** Отзывы соискателей о компаниях и вакансиях

   Можно сэкономить кучу времени и денег просто не нанимаясь в те компании, в которых "все
   плохо". В этом плане соискатели могут помоч друг другу. Возможно и компании тоже будут
   прислушиваться к такому фидбеку

** Маршрут

   Иногда я хочу спланировать маршрут поездки по собеседованиям. Это сервис с картами,
   которые можно сделать позже.

* Сущности
** Поисковые профили

   #+CAPTION: Данные поискового профиля
   #+NAME: profile_flds
     | field name | field type           | note                                      |
     |------------+----------------------+-------------------------------------------|
     | id         | serial               | идентификатор                             |
     | user-id    | integer              | владелец и создатель                      |
     | query      | varchar              | поисковый запрос                          |
     | ts-create  | bigint               | время создания                            |
     | ts-last    | bigint               | время когда был использован последний раз |

** Сборки

   Сборка создается по запросу пользователя в состоянии =sheduled=. Это происходит в секции
   [[Интерфейс планирования сбора данных]]

   После сбора данных сборка переходит в состояние =executed= и ее данные становятся
   доступны для просмотра

   #+CAPTION: Данные сборки
   #+NAME: collection_flds
     | field name | field type | note                             |
     |------------+------------+----------------------------------|
     | id         | serial     | идентификатор                    |
     | profile-id | integer    | поисковый профиль                |
     | ts-create  | bigint     | время создания                   |
     | ts-shedule | bigint     | время когда сборка запланирована |

   #+CAPTION: Состояния конечного автомата сборки
   #+NAME: collection_state
     | action         | from     | to          |
     |----------------+----------+-------------|
     | sheduled       | sheduled | executed    |

** Вакансии

   #+CAPTION: Данные вакансии
   #+NAME: collection_flds
     | field name    | field type | note                                  |
     |---------------+------------+---------------------------------------|
     | id            | serial     | идентификатор                         |
     | collection-id | integer    | идентификатор сборки                  |
     | contact       | varchar    | телефон контактного лица              |
     | salary        | integer    | размер компенсации                    |
     | text          | varchar    | описание вакансии                     |
     | ts-created    | bigint     | время создания вакансии               |
     | ts-viewed     | bigint     | время когда вакансия была просмотрена |

   TODO: Конечный автомат тут сложен и будет еще уточняться... Пока состояния такие:
    =просмотрено= (с датой), =отобрано=, =не-берут-трубку=, =не-актуально=,
    =приглашен-на-интервью=, =тестовое-задание=, =получен-оффер=, =отказано-работодателем=,
    =отказ-соискателя=, =вакансия-снята= итп.

   С точки зрения соискателя процесс найма выглядит так (неплохо бы приложить временную
   схему протокола):

   - Этап поиска
     - Поиск и просмотр вакансий, отсев, ранжирование
     - Рассылка откликов
   - Этап телефонных переговоров
     - Получение звонков, обсуждение деталей по телефону
     - Опционально: договоренность о еще одном звонке
     - Опционально: тестовое задание на почту
     - Опционально: договоренность о skype-интервью
   - Этап удаленного тестирования
     - Skype-интервью
     - Ожидание тестового задания
     - Выполнение тестового задания
   - Этап очного собеседования
     - Приглашение на интервью
     - Интервью
   - Этап отбора предложений
     - Получение предложений
     - Выбор предложения

   #+CAPTION: Состояния конечного автомата вакансии
   #+NAME: collection_state
     | action  | from     | to        |
     |---------+----------+-----------|
     | view    | created  | viewed    |
     | respond | viewed   | responded |

** TODO Перекрестные связи с другими вакансиями

   В ряде случаев компании меняют свои вакансии, некоторые делают это методом удаления
   предыдущей и создания новой. Мне как соискателю хотелось бы не обнаруживать уже
   просмотренную и возможно собеседованную вакансию в новых. Поэтому хотелось бы
   предусмотреть механизм, который связывает очень похожие вакансии друг с другом.

   Иногда вакансии меняются, или в них меняются существенные условия. Например, две недели
   назад, когда я смотрел вакансию из предыдущей сборки меня не устроила зарпалата, а
   сегодня вакансия стала интереснее. Я хочу отслеживать что вакансия поменялась.

** Компании

   Несколько вакансий могут быть от одной компании. В этом случае мне бы хотелось
   отслеживать это в профиле компании, кроме того интересна аналитика по этой компании за
   определенный период времени.

   С социальной точки зрения интересно получать отзывы о компании от ее работников, в том
   числе и уволенных.

** Действия по вакансии: звонки, скайп-интервью, собеседования

   В эту таблицу заносим что сделано по каждой вакансии, которая находится в разработке

** Теги вакансий

   Помогают ориентироваться, когда вакансий много.

