hh.html

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Дашборд</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Если у нас есть формализованный алгоритм (а он есть, так как найм - это линейный
процесс), то я хочу получать напоминания о моем следующем шаге в отношении тех вакансий,
которые мне интересны.
</p>

<p>
Мне бы хотелось видеть на каком я этапе в тех вакансиях, которые меня интересуют.
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Отзывы соискателей о компаниях и вакансиях</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Можно сэкономить кучу времени и денег просто не нанимаясь в те компании, в которых "все
плохо". В этом плане соискатели могут помоч друг другу. Возможно и компании тоже будут
прислушиваться к такому фидбеку
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Маршрут</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Иногда я хочу спланировать маршрут поездки по собеседованиям. Это сервис с картами,
которые можно сделать позже.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Сущности</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Поисковые профили</h3>
<div class="outline-text-3" id="text-3-1">
<table id="profile_flds" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Данные поискового профиля</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">field name</th>
<th scope="col" class="left">field type</th>
<th scope="col" class="left">note</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">id</td>
<td class="left">serial</td>
<td class="left">идентификатор</td>
</tr>

<tr>
<td class="left">user-id</td>
<td class="left">integer</td>
<td class="left">владелец и создатель</td>
</tr>

<tr>
<td class="left">query</td>
<td class="left">varchar</td>
<td class="left">поисковый запрос</td>
</tr>

<tr>
<td class="left">ts-create</td>
<td class="left">bigint</td>
<td class="left">время создания</td>
</tr>

<tr>
<td class="left">ts-last</td>
<td class="left">bigint</td>
<td class="left">время когда был использован последний раз</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Сборки</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Сборка создается по запросу пользователя в состоянии <code>sheduled</code>. Это происходит в секции
<a href="#sec-4-2">4.2</a>
</p>

<p>
После сбора данных сборка переходит в состояние <code>executed</code> и ее данные становятся
доступны для просмотра
</p>

<table id="collection_flds" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Данные сборки</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">field name</th>
<th scope="col" class="left">field type</th>
<th scope="col" class="left">note</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">id</td>
<td class="left">serial</td>
<td class="left">идентификатор</td>
</tr>

<tr>
<td class="left">profile-id</td>
<td class="left">integer</td>
<td class="left">поисковый профиль</td>
</tr>

<tr>
<td class="left">ts-create</td>
<td class="left">bigint</td>
<td class="left">время создания</td>
</tr>

<tr>
<td class="left">ts-shedule</td>
<td class="left">bigint</td>
<td class="left">время когда сборка запланирована</td>
</tr>
</tbody>
</table>

<table id="collection_state" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> Состояния конечного автомата сборки</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">action</th>
<th scope="col" class="left">from</th>
<th scope="col" class="left">to</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">sheduled</td>
<td class="left">sheduled</td>
<td class="left">executed</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Вакансии</h3>
<div class="outline-text-3" id="text-3-3">
<table id="collection_flds" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 4:</span> Данные вакансии</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">field name</th>
<th scope="col" class="left">field type</th>
<th scope="col" class="left">note</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">id</td>
<td class="left">serial</td>
<td class="left">идентификатор</td>
</tr>

<tr>
<td class="left">collection-id</td>
<td class="left">integer</td>
<td class="left">идентификатор сборки</td>
</tr>

<tr>
<td class="left">contact</td>
<td class="left">varchar</td>
<td class="left">телефон контактного лица</td>
</tr>

<tr>
<td class="left">salary</td>
<td class="left">integer</td>
<td class="left">размер компенсации</td>
</tr>

<tr>
<td class="left">text</td>
<td class="left">varchar</td>
<td class="left">описание вакансии</td>
</tr>

<tr>
<td class="left">ts-created</td>
<td class="left">bigint</td>
<td class="left">время создания вакансии</td>
</tr>

<tr>
<td class="left">ts-viewed</td>
<td class="left">bigint</td>
<td class="left">время когда вакансия была просмотрена</td>
</tr>
</tbody>
</table>

<p>
TODO: Конечный автомат тут сложен и будет еще уточняться&#x2026; Пока состояния такие:
 <code>просмотрено</code> (с датой), <code>отобрано</code>, <code>не-берут-трубку</code>, <code>не-актуально</code>,
 <code>приглашен-на-интервью</code>, <code>тестовое-задание</code>, <code>получен-оффер</code>, <code>отказано-работодателем</code>,
 <code>отказ-соискателя</code>, <code>вакансия-снята</code> итп.
</p>

<p>
С точки зрения соискателя процесс найма выглядит так (неплохо бы приложить временную
схему протокола):
</p>

<ul class="org-ul">
<li>Этап поиска
<ul class="org-ul">
<li>Поиск и просмотр вакансий, отсев, ранжирование
</li>
<li>Рассылка откликов
</li>
</ul>
</li>
<li>Этап телефонных переговоров
<ul class="org-ul">
<li>Получение звонков, обсуждение деталей по телефону
</li>
<li>Опционально: договоренность о еще одном звонке
</li>
<li>Опционально: тестовое задание на почту
</li>
<li>Опционально: договоренность о skype-интервью
</li>
</ul>
</li>
<li>Этап удаленного тестирования
<ul class="org-ul">
<li>Skype-интервью
</li>
<li>Ожидание тестового задания
</li>
<li>Выполнение тестового задания
</li>
</ul>
</li>
<li>Этап очного собеседования
<ul class="org-ul">
<li>Приглашение на интервью
</li>
<li>Интервью
</li>
</ul>
</li>
<li>Этап отбора предложений
<ul class="org-ul">
<li>Получение предложений
</li>
<li>Выбор предложения
</li>
</ul>
</li>
</ul>

<table id="collection_state" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 5:</span> Состояния конечного автомата вакансии</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">action</th>
<th scope="col" class="left">from</th>
<th scope="col" class="left">to</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">view</td>
<td class="left">created</td>
<td class="left">viewed</td>
</tr>

<tr>
<td class="left">respond</td>
<td class="left">viewed</td>
<td class="left">responded</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <span class="todo TODO">TODO</span> Перекрестные связи с другими вакансиями</h3>
<div class="outline-text-3" id="text-3-4">
<p>
В ряде случаев компании меняют свои вакансии, некоторые делают это методом удаления
предыдущей и создания новой. Мне как соискателю хотелось бы не обнаруживать уже
просмотренную и возможно собеседованную вакансию в новых. Поэтому хотелось бы
предусмотреть механизм, который связывает очень похожие вакансии друг с другом.
</p>

<p>
Иногда вакансии меняются, или в них меняются существенные условия. Например, две недели
назад, когда я смотрел вакансию из предыдущей сборки меня не устроила зарпалата, а
сегодня вакансия стала интереснее. Я хочу отслеживать что вакансия поменялась.
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Компании</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Несколько вакансий могут быть от одной компании. В этом случае мне бы хотелось
отслеживать это в профиле компании, кроме того интересна аналитика по этой компании за
определенный период времени.
</p>

<p>
С социальной точки зрения интересно получать отзывы о компании от ее работников, в том
числе и уволенных.
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Действия по вакансии: звонки, скайп-интервью, собеседования</h3>
<div class="outline-text-3" id="text-3-6">
<p>
В эту таблицу заносим что сделано по каждой вакансии, которая находится в разработке
</p>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Теги вакансий</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Помогают ориентироваться, когда вакансий много.
</p>
</div>
</div>
</div>
